/* eslint-disable no-plusplus */
const targetString = `كيف تبرمجى أطفالك إيجابيا بالهمس أثناء النوم ؟
👶👭👫
ماذا يحدث أثناء نوم الطفل⁉️
عندما يكون العقل الواعي يغط في نوم عميق 😴يكون العقل اللاواعي أو العقل الباطن مستيقظا و صاحيا .😳
و لهذا فبوابة العقل اللاواعي ستكون مفتوحة تماما للإستقبال و يستطيع الوالدين برمجة الطفل بما يريدان أو إدخال أي معلومة يريدانها لتحسين سلوك طفلهم
💥 تمرين فعال لإدخال الأفكار و تصحيح السلوك 💥
أثناء النوم أهمس بأذن طفلك اليمنى 👂بماتريد أن يتبرمج داخله بطريقة محاكاة العقل اللاواعي
،مثلا :
👂🗣👂🗣👂🗣👂👶
إسم طفلك احمد ،إهمس في أذن طفلك اليمنى و قل له أحمد ذكي أحمد شاطر أحمد يحب الحليب ،أحمد جميل و يحبه بابا و ماما ،أحمد رائع و يساعد ماما ،أحمد يحب أخته الصغيرة و يخاف عليها ،و يساعدها و يلعب معها و هكذا،،،
🌺سأذكر تجربة لإحدى المعترضات على هذه الطريقة 🌺
المعترضة ذكرت أن طفلها الذي يبلغ السنتين و النصف لم يعد يشرب الحليب و هو منذ أكثر من سنة يرفض شرب الحليب وجربت أمه كل شيء معه لكن لا فائدة فطلبت منها تطبيق إختبار هذه التقنية ( محاكاة العقل اللاواعي )
فلان يحب أن يشرب الحليب والنتيجة كانت مذهلة !❗️
أخر يوم وقفت هذه المعترضه أمام ٤٥ متدربة وقالت :-
كما سخرت من هذه التقنية فمن باب الأمانة أن اذكر ماحدث لي عندما رجعت المنزل و وجدت طفلي نائما حملته على كتفي ورددت العبارة عدة مرات وأنا أردد العبارة صحي طفلي من نومه وكنت وضعت كوب حليب أمامه ولأول مره يشرب طفلي القليل من الحليب لم يشرب الكوب كله لكن ماحدث معجزة
❗️❗️❗️❗️❗️❗️❗️❗️❗️❗️
🔰 الأطفال سهلين جدا باستعمال البرمجة لأن ليس لديهم نظام فلترة (أي يقبل بسهوله و لا يرفض ما يردد أمامه على مسامعهم)
لهذا انتبهوا لا ترددوا دائما أمامهم أشياء سلبية عنهم وعن قدراتهم او عن انفسكم .
لاحظ أن الطفل يسمع فتح تغليفة الحلوى على بعد ٥٠ متر .
فانتبه و لاتقول أنه لايسمع إنه يلعب الآن و مشغول كلنا كنا أطفالا وسمعنا اشياء لم يكن قصدهم إسماعنا إياها ولكن سمعناها وتظاهرنا بعدم سماعها.
🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀
💠 حالة تثبت برمجة العقل اللاواعي لطفل 💠
طفل أدخل للمستشفى لإستصال اللوزتين و هى عملية روتينة (سهلة و بسيطة ) لكن تدهورت حالته وأصيب بنزيف وأوشك
على الموت بدأ الفريق الطبي يبحث عن الأسباب ويراجعون الأمر حتى علموا (الأثر رجعي ) أن الخطأ الوحيد هو عند تخدير الطفل كان الأطباء يتحدثون عن عدم نجاة مريضة اخرى خرجت للتو من العمليات
💠 وحينئذ قرر الأطباء إجراء عملية وهمية للطفل لتعديل الشئ السلبي الذي حصل في العقل اللاواعي و فعلا تم تخدير الطفل تخديرا خفيفا وتظاهر الفريق الطبي باجراء العملية من جديد مع ترديد عبارات تشجعيه وأن الامر سهلا والشفاء السريع وفعلا تشافى الطفل تماما .
👬👭👫👭👬👫👭👫
ما الفائدة من هذه الأمثلة ؟⁉️
✅ لو عندك طفل يعاني من :
التبول الليلي ،الخوف ،
صعوبة بالدراسة ،عصبية ،
لا يريد حفظ القرآن ،
ضعيف باللغة العربية ،ضعيف بالرياضيات ،ضعيف بمادة اللغة E
ماذا نفعل ؟❓❓
👂أثناء نومه إهمس بأذنه اليمنى بإسمه مثلا إسمه يوسف ،يوسف طفل رائع وماما وبابا ،يحبونه و يوسف يقدر ،يوسف شاطر في مادة العربي و بارع في القراءة ،يوسف ذكي في الحساب و هكذا.
ملحوظة هامة انتبه لاتقول أى جمله بصيغه النفي ابدا أياك ثم أياك
❌ ❌ ❌ ❌
يعنى لا تقل يوسف لا يخاف - هبه لا تتعصب لأن العقل اللاواعي لايفهم النفي بل يحذف النفي تلقائيا و يطبق الذي بعدها و يعيها فسيبرمجها مثلا : فلان لا يعصب (سيفهمها العقل اللاواعي ) = فلان يعصب ،وفلان لا يخاف = فلان يخاف
ماذا أقول إذا ؟🤔🤔
✔️ بل قل فلان هادئ و صبور فلان شجاع و قوي
وهكذا كرر العبارات الإيجابية ثلاث دقائق و لمدة 14 يوما متتاليا
و إنتظر النتائج المبهرة بإذن الله 💯💯
🔵 - تبول لا إرادى تهمس له وتقول = فلان طفل رائع والكل يحبه وماما وبابا يحبونه وهو نايم يقدر يحس ويصحى بكل سهولة ويعمل في الحمام
🔵 – طفلك عنيف او عصبي= فلان شاطر والكل يحبه وماما وبابا يحبونه؛ وفلان هادي ويتحكم باعصابه و صبور و عادي ولطيف مع اصحابه او اخوانه.
🔵 – طفلك لايحب مادة دراسية او المدرسة فلان طفل رائع ومحبوب وماما وبابا يحبونه وفلان يحب يصحى الصباح ويذهب للمدرسة و يحب المدرسة ويستمتع بالدراسة
👌 كل كلمة تكررها ما هي إلا أمر ليصبح واجب التنفيذ للعقل اللاواعي
– ماذكرت من تقنية تم تطبيقها على العديد من الحالات والنتائج دائما كانت مبهرة
من كتاب ( سر الطفل السعيد )
👇👇👇
كورس التربية من عمر يوم لسن المراهقة يبدا الاربعاء الكورس اون لاين بتحضره من اي مكان لحجزه والسوال علي تفاصيله التواصل واتس اب علي

01142521221`;

const candidateString = `كيف تبرمجى أطفالك إيجابيا بالهمس أثناء النوم ؟
👶👭👫
ماذا يحدث أثناء نوم الطفل⁉️
عندما يكون العقل الواعي يغط في نوم عميق 😴يكون العقل اللاواعي أو العقل الباطن مستيقظا و صاحيا .😳
و لهذا فبوابة العقل اللاواعي ستكون مفتوحة تماما للإستقبال و يستطيع الوالدين برمجة الطفل بما يريدان أو إدخال أي معلومة يريدانها لتحسين سلوك طفلهم
💥 تمرين فعال لإدخال الأفكار و تصحيح السلوك 💥
أثناء النوم أهمس بأذن طفلك اليمنى 👂بماتريد أن يتبرمج داخله بطريقة محاكاة العقل اللاواعي
،مثلا :
👂🗣👂🗣👂🗣👂👶
إسم طفلك احمد ،إهمس في أذن طفلك اليمنى و قل له أحمد ذكي أحمد شاطر أحمد يحب الحليب ،أحمد جميل و يحبه بابا و ماما ،أحمد رائع و يساعد ماما ،أحمد يحب أخته الصغيرة و يخاف عليها ،و يساعدها و يلعب معها و هكذا،،،
🌺سأذكر تجربة لإحدى المعترضات على هذه الطريقة 🌺
المعترضة ذكرت أن طفلها الذي يبلغ السنتين و النصف لم يعد يشرب الحليب و هو منذ أكثر من سنة يرفض شرب الحليب وجربت أمه كل شيء معه لكن لا فائدة فطلبت منها تطبيق إختبار هذه التقنية ( محاكاة العقل اللاواعي )
فلان يحب أن يشرب الحليب والنتيجة كانت مذهلة !❗️
أخر يوم وقفت هذه المعترضه أمام ٤٥ متدربة وقالت :-
كما سخرت من هذه التقنية فمن باب الأمانة أن اذكر ماحدث لي عندما رجعت المنزل و وجدت طفلي نائما حملته على كتفي ورددت العبارة عدة مرات وأنا أردد العبارة صحي طفلي من نومه وكنت وضعت كوب حليب أمامه ولأول مره يشرب طفلي القليل من الحليب لم يشرب الكوب كله لكن ماحدث معجزة
❗️❗️❗️❗️❗️❗️❗️❗️❗️❗️
🔰 الأطفال سهلين جدا باستعمال البرمجة لأن ليس لديهم نظام فلترة (أي يقبل بسهوله و لا يرفض ما يردد أمامه على مسامعهم)
لهذا انتبهوا لا ترددوا دائما أمامهم أشياء سلبية عنهم وعن قدراتهم او عن انفسكم .
لاحظ أن الطفل يسمع فتح تغليفة الحلوى على بعد ٥٠ متر .
فانتبه و لاتقول أنه لايسمع إنه يلعب الآن و مشغول كلنا كنا أطفالا وسمعنا اشياء لم يكن قصدهم إسماعنا إياها ولكن سمعناها وتظاهرنا بعدم سماعها.
🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀
💠 حالة تثبت برمجة العقل اللاواعي لطفل 💠
طفل أدخل للمستشفى لإستصال اللوزتين و هى عملية روتينة (سهلة و بسيطة ) لكن تدهورت حالته وأصيب بنزيف وأوشك
على الموت بدأ الفريق الطبي يبحث عن الأسباب ويراجعون الأمر حتى علموا (الأثر رجعي ) أن الخطأ الوحيد هو عند تخدير الطفل كان الأطباء يتحدثون عن عدم نجاة مريضة اخرى خرجت للتو من العمليات
💠 وحينئذ قرر الأطباء إجراء عملية وهمية للطفل لتعديل الشئ السلبي الذي حصل في العقل اللاواعي و فعلا تم تخدير الطفل تخديرا خفيفا وتظاهر الفريق الطبي باجراء العملية من جديد مع ترديد عبارات تشجعيه وأن الامر سهلا والشفاء السريع وفعلا تشافى الطفل تماما .
👬👭👫👭👬👫👭👫
ما الفائدة من هذه الأمثلة ؟⁉️
✅ لو عندك طفل يعاني من :
التبول الليلي ،الخوف ، اللغة E
ماذا نفعل ؟❓❓
👂أثناء نومه إهمس بأذنه اليمنى بإسمه مثلا إسمه يوسف ،يوسف طفل رائع وماما وبابا ،يحبونه و يوسف يقدر ،يوسف شاطر في مادة العربي و بارع في القراءة ،يوسف ذكي في الحساب و هكذا.
ملحوظة هامة انتبه لاتقول أى جمله بصيغه النفي ابدا أياك ثم أياك
❌ ❌ ❌ ❌
يعنى لا تقل يوسف لا يخاف - هبه لا تتعصب لأن العقل اللاواعي لايفهم النفي بل يحذف النفي تلقائيا و يطبق الذي بعدها و يعيها فسيبرمجها مثلا : فلان لا يعصب (سيفهمها العقل اللاواعي ) = فلان يعصب ،وفلان لا يخاف = فلان يخاف
ماذا أقول إذا ؟🤔🤔سة ويستمتع بالدراسة
👌 كل كلمة تكررها ما هي إلا أمر ليصبح واجب التنفيذ للعقل اللاواعي
– ماذكرت من تقنية تم تطبيقها على العديد من الحالات والنتائج دائما كانت مبهرة
من كتاب ( سر الطفل السعيد )
👇👇👇
كورس التربية من عمر يوم لسن المراهقة يبدا الاربعاء الكورس اون لاين بتحضره من اي مكان لحجزه والسوال علي تفاصيله التواصل واتس اب علي

01142521221`;

// @ Levenshtein distance algorithm
// A Naive recursive C++ program to find minimum number
// operations to convert listOfCandidateString to listOfTargetString

const editDist = (listOfCandidateString, listOfTargetString, m, n) => {
  // Create a table to store results of subproblems
  const dp = new Array(m + 1);
  for (let i = 0; i < dp.length; i++) dp[i] = new Array(n + 1).fill(0);

  // Fill d[][] in bottom up manner
  for (let i = 0; i <= m; i++) {
    for (let j = 0; j <= n; j++) {
      // If first string is empty, only option is to
      // insert all characters of second string
      if (i === 0) dp[i][j] = j;
      // Min. operations = j
      // If second string is empty, only option is to
      // remove all characters of second string
      else if (j === 0) dp[i][j] = i;
      // Min. operations = i
      // If last characters are same, ignore last char
      // and recur for remaining string
      // eslint-disable-next-line max-len
      else if (listOfCandidateString[i - 1] === listOfTargetString[j - 1]) dp[i][j] = dp[i - 1][j - 1];
      // If the last character is different, consider all
      // possibilities and find the minimum
      else {
        dp[i][j] = 1
          + Math.min(
            dp[i][j - 1], // Insert
            dp[i - 1][j], // Remove
            dp[i - 1][j - 1],
          );
      } // Replace
    }
  }

  return dp[m][n];
};

const listOfCandidateString = candidateString.split(/\s+/g);
const listOfTargetString = targetString.split(/\s+/g);

console.time('> editDist');

const MED = editDist(
  listOfCandidateString,
  listOfTargetString,
  listOfCandidateString.length,
  listOfTargetString.length,
);

console.timeEnd('> editDist');

const candidateThresholdToBeFlaggedAsSpam = Math.floor(0.2 * listOfCandidateString.length);
const hasSpam = MED <= candidateThresholdToBeFlaggedAsSpam;

console.log(
  `> from lenght is: ${listOfCandidateString.length} \n> to length is: ${listOfCandidateString.length}  \n> minimum edit distance is: ${MED}\n> will be marked as spam: ${hasSpam}`,
);
